In [1]:
from gen_fake_data import get_fake_data
from process_data import transform_data
import pandas as pd
from pandasql import sqldf

In [2]:
# Generation of the data
n_samples = 10
data = [get_fake_data() for _ in range(n_samples)]

In [3]:
# Show data without any transformation
# data

In [4]:
df = pd.DataFrame(data)
df

,name,address,email,phone_number,country
0,Mr Geoffrey Gardiner,3 Bell mountain\nEvansshire\nS8 7PU,suzanne89@example.org,+44113 4960017,Libyan Arab Jamahiriya
1,Holly O'Connor,Studio 53\nO'Neill creek\nNew Bryanland\nL4E 7XN,jameslinda@example.org,(0161) 496 0152,Zimbabwe
2,Reece Begum-Davies,3 David ridges\nRosefort\nSK6W 7WN,kenneth10@example.net,(0808)1570999,Djibouti
3,Mathew Clements,58 Kathryn pike\nLake Nigelborough\nDD3B 7RN,leonardhenderson@example.com,+4420 74960644,Fiji
4,Amber Henderson,4 Barbara locks\nWest Benview\nLS0N 2TR,cartereleanor@example.net,+44306 999 0926,Nigeria
5,Samuel Morris,Flat 82\nHugh turnpike\nCherylstad\nN10 7WU,kirbykaren@example.net,(0191) 4960820,New Caledonia
6,Jane Francis-Elliott,Flat 9\nJean motorway\nLake Dianeside\nB0W 5LJ,conwayfrancis@example.org,+44(0)20 74960355,Myanmar
7,Karl Lloyd,Studio 23N\nMarian parkway\nStanleyfort\nE48 8NZ,normanlynch@example.net,(0909) 879 0224,Kyrgyz Republic
8,Kerry Whitehead,61 Gillian corner\nHewittfort\nW43 9ZZ,callum69@example.org,+441632 960113,French Polynesia
9,Marilyn Pearce,Studio 24\nFrank wells\nPort Danny\nS01 1EU,llynch@example.net,+44(0)118 496 0610,Wallis and Futuna

In [6]:
q = """
SELECT *
FROM df
WHERE country = 'Zimbabwe'
"""

In [7]:
test = sqldf(q)
test

,name,address,email,phone_number,country
0,Holly O'Connor,Studio 53\nO'Neill creek\nNew Bryanland\nL4E 7XN,jameslinda@example.org,(0161) 496 0152,Zimbabwe